# Гасимова Аміна 141 група
# Лабораторна робота 3
# 20. Дано дійсне число ε (> 0). Послідовність дійсних чисел AK визначається наступним чином:A1 = 1,
# A2 = 2, AK = (AK-2 + 2 • AK-1) / 3, K = 3, 4, ....Знайти перший з номерів K, для яких виконується умова |
# AK - AK-1 | <Ε, і вивести цей номер, а також числа AK-1 і AK.
e = float(input("Введіть дійсне число e > 0: "))
Ak = 2
A1 = 1
i = 1
while abs(Ak - A1) >= e:
    A2 = A1
    A1 = Ak
    Ak = (A2 + 2 * A1)/3
    i += 1
print("№", i, "числo AK-1:", A1, " ", "числo AK: ", Ak)
